cloud/soap/booking/fetch.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CelsiusToFahrenheit>
         <!--Optional:-->
         <tem:Celsius>##TEMP##</tem:Celsius>
      </tem:CelsiusToFahrenheit>
   </soapenv:Body>
</soapenv:Envelope>